# 🍎 파이썬 머신러닝 완벽 가이드 혼공

### 2019.03.05 ~ 2019.03.28 교재 1,2장

코로나19 사태로 1,2장은 혼자 공부해야 하는데, 양이 많아서 농땡이 부리지 말고 열심히 하자^*^

01. 파이썬 기반의 머신러닝과 생태계 이해 
02. 사이킷런으로 시작하는 머신러닝

Let's get started⚽️!

### 2020-03-09-Mon

진도: 04. 데이터 핸들링 - 판다스 ~ (39쪽~)

### 04. 데이터 핸들링 - 판다스 

#### 판다스 시작 - 파일을 DataFrame으로 로딩, 기본 API

- 판다스는 다양한 포맷으로 된 파일을 **DataFrame**으로 로딩할 수 있는 편리한 API를 제공함.
- **DataFrame**: 행과 열을 가지는 2차원 데이터
- **read_csv()**: CSV(칼럼을 ','로 구분한 파일 포맷) 파일 포맷 변환을 위한 API, **어떤 필드 구분 문자 기반의 파일 포맷도 DataFrame으로 변환 가능함.** 예를 들어, read_dsv('파일명', **sep='\t'**)라 써주면 콤마 대신 탭으로 변환할 수 있음.
- **read_table()**: 디폴트 필드 구분 문자는 탭('\t') 문자 (csv는 쉼표임)
- **read_fwf()**: Fixed Width, 고정 길이 기반의 칼럼 포맷을 DataFrame으로 로딩하기 위한 API

In [1]:
import numpy as np
import pandas as pd

- 파일 경로를 확실하게 설정해주는 것이 중요!
- 동일한 폴더에 있을 때에는 파일명만 써주어도 되지만, 다른 폴더에 있을 경우에는 구체적인 경로를 지정해줘야 함.
- read_csv()는 별다른 파라미터 지정이 없으면 파일의 맨 처음 로우를 칼럼명으로 인지하고 칼럼으로 변환함. 
- 맨 왼쪽 컬럼은 **판다스의 Index 객체 값**
- **df.head(n)**: 데이터프레임의 맨 앞에 있는 N개의 로우를 반환

In [2]:
# 동일한 폴더에 위치할 경우에만 가능! 이 파일 자체가 DataFrame으로 읽히는 것!
titanic_df = pd.read_csv('titanic_train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [3]:
type(titanic_df)

pandas.core.frame.DataFrame

- **df.shape**: 행과 열 크기를 알 수 있는 방법

In [4]:
titanic_df.shape

(891, 12)

- **df.info()**: 총 데이터 건수와 Null 건수, 데이터 타입을 알 수 있음. 
- object 데이터 타입은 문자열 타입이라 생각해도 무방함.

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

- **df.describe()**: 칼럼별 숫자형 데이터값의 n-percentile 분포도, 평균값, 최댓값, 최솟값을 나타냄. 오직 숫자형 칼럼의 분포도만 조사하며 자동으로 object 타입의 칼럼은 출력에서 제외시킴. 
- count(Not Null인 데이터 건수), mean(전체 데이터의 평균값), std(표준편차), min(최솟값), max(최댓값), n%(n percentile 값)
- 해당 숫자 칼럼이 숫자형 카테고리 칼럼(예. 여-1, 남-2)인지를 판단할 수 있게 도와줌. 예를 들어 Survived는 최소가 0, 최대가 1, 중간에는 값이 없으므로 카테고리형 칼럼. Parch 칼럼도 마찬가지!

In [6]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

- **df['칼럼명']**: 데이터 프레임의 특정 칼럼만 떼어서 Series로 쓸 수 있음. 
- **value_counts()**: 해당 칼럼값의 유형과 건수를 확인할 수 있음.

In [7]:
value_counts = titanic_df['Pclass'].value_counts()
value_counts    # 왼쪽 칼럼이 Index!

3    491
1    216
2    184
Name: Pclass, dtype: int64

- **Series**: Index와 단 하나의 칼럼으로 구성된 데이터 세트

In [8]:
type(value_counts)

pandas.core.series.Series

#### DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환 

사이킷런의 많은 API는 기본적으로 넘파이 ndarray를 입력 인자로 사용하는 경우가 대부분임. 그래서 DataFrame과 넘파이 ndarray 상호 간의 변환이 빈번하게 발생. 

##### 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기

- 리스트와 넘파이 ndarray를 DataFrame으로 변환

In [9]:
col_name1 = ['col1']  # 1차원 데이터를 기반으로 생성하니까 칼럼명은 1개
list1 = [1,2,3]
array1 = np.array(list1)
array1.shape

(3,)

In [10]:
# 리스트를 이용해 DataFrame 생성 
df_list1 = pd.DataFrame(list1, columns = col_name1)
df_list1

   col1
0     1
1     2
2     3

In [11]:
# 넘파이 ndarray를 이용해 DataFrame 생성 
df_array1 = pd.DataFrame(array1, columns=col_name1)
df_array1

   col1
0     1
1     2
2     3

In [12]:
col_name2 = ['col1','col2','col3']  # 2*3이므로 칼럼명은 3개가 필요

# 2행x3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2 = [[1,2,3],
        [11,12,13]]
array2 = np.array(list2)
array2.shape

(2, 3)

In [13]:
df_list2 = pd.DataFrame(list2, columns = col_name2)
df_list2

   col1  col2  col3
0     1     2     3
1    11    12    13

In [14]:
df_array2 = pd.DataFrame(array2, columns = col_name2)
df_list2

   col1  col2  col3
0     1     2     3
1    11    12    13

- 딕셔너리를 DataFrame으로 변환
- 딕셔너리의 키(key)는 컬럼명으로, 딕셔너리의 값(value)은 키에 해당하는 칼럼 데이터로 변환

In [15]:
dict = {'col1':[1,11],'col2':[2,22],'col3':[3,33]}
df_dict = pd.DataFrame(dict)
df_dict

   col1  col2  col3
0     1     2     3
1    11    22    33

##### DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기 

🍑🍑🍑많은 머신러닝 패키지가 기본 데이터 형으로 넘파이 ndarray를 사용함. 그래서 데이터 핸들링은 DataFrame을 이용하더라도 머신러닝 패키지의 입력 인자 등에 적용하기 위해서는 **다시 넘파이 ndarray로 변환하는 경우가 빈번하게 발생함.** 

- **df.values**: 데이터프레임을 ndarray로 변환하기

In [16]:
# DataFrame을 ndarray로 변환 
array3 = df_dict.values
print(type(array3),'\n', array3)

<class 'numpy.ndarray'>
 [[ 1  2  3]
 [11 22 33]]

- **df.values.tolist()**: 데이터프레임이 리스트로 변환. **tolist()**는 리스트 자료형으로 변화시키는 것.
- **df.to_dict('list')**: 데이터프레임이 딕셔너리로 변환

In [17]:
# DataFrame을 리스트로 변환
list3= df_dict.values.tolist()
print(type(list3))
print(list3)

<class 'list'>
[[1, 2, 3], [11, 22, 33]]

In [18]:
# DataFrame을 딕셔너리로 변환 
dict3 = df_dict.to_dict('list') # 여기 list는 변수가 아님. 
print(type(dict3))
print(dict3)

<class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

### 2020-03-10-Tue

진도: 04. 데이터 핸들링 - 판다스 ~ (52쪽~)

#### DataFrame의 칼럼 데이터 세트 생성과 수정

- **df['칼럼명'] = 데이터**: 새로운 칼럼 만들기

In [19]:
titanic_df['Age_0'] = 0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [20]:
# 기존 데이터로 새로운 칼럼 채워넣기 
titanic_df['Age_by_10'] = titanic_df['Age'] * 10
titanic_df['Family_No'] = titanic_df['SibSp'] + titanic_df['Parch'] + 1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

#### DataFrame 데이터 삭제

- **df.drop()**: 데이터의 삭제 
- DataFrame.drop(**labels=None**, **axis=0**, index=None, columns=None, level=None, **inplace=False**, errors='raise'), 중요한 파라미터가 labels, axis, inplace! 
- **axis 파라미터**: axis=0 이라면, row가 드랍, axis=1이라면 column이 드랍!

In [21]:
# 컬럼 삭제하기 
titanic_drop_df = titanic_df.drop('Age_0', axis = 1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0,1

In [22]:
# 간단히 표시하는 법! axis를 적지않아도 됨!
titanic_drop_df = titanic_df.drop('Age_0', 1)
titanic_drop_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,260.0,1

- **inplace 파라미터**: default는 inplace=False, 자기 자신의 데이터프레임의 데이터는 삭제하지 않음. 
- **inplace=False**: 자기 자신의 데이터프레임의 데이터는 삭제하지 않음. 
- **inplace=True**: 자기 자신의 데이터프레임의 데이터도 삭제함. 
- 여러개 드랍하고 싶을 때에는 (labels)**['변수명1', '변수명2',...]**로 적으면 됨.
- 즉, 원본 DataFrame을 유지하고 드롭된 DataFrame을 새롭게 객체 변수로 받고 싶다면 inplace=False로 설정하고, 원본 DataFrame에 드롭된 결과를 적용할 경우에는 inplace=True를 적용!

In [23]:
# 여기에서 보듯, 앞의 drop()은 원 DataFrame에 영향 미치지 않음. 즉, Age_0이 살아있음.
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [24]:
drop_result = titanic_df.drop(['Age_0','Age_by_10','Family_No'], axis=1, inplace=True)
print(drop_result)  # 이렇듯 inplace=True는 아예 객체 변수를 None으로 만들어버림.

None

In [25]:
# 3개 칼럼이 모두 없어진 것을 볼 수 있음.
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [26]:
# row 삭제하기!
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 15)
print('#### before axis 0 drop ####')
print(titanic_df.head(3))

titanic_df.drop([0,1,2], axis=0, inplace=True)

print('#### after axis 0 drop ####')
print(titanic_df.head(3))

#### before axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S
#### after axis 0 drop ####
   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
3            4         1       1  Futrelle, M...  female  35.0      1      0  113803  53.1000  C123        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0  373450   8.0500   NaN        S
5            6         0       3  Moran, Mr. ...    male   NaN      0      0  330877   8.4583   NaN        Q

#### Index 객체 

- **index 객체**는 DataFrame, Series의 레코드를 고유하게 식별하는 객체
- **Series.index**, **DataFrame.index**로 index 객체만 추출할 수 있음.
- 반환된 index 객체의 실제 값은 넘파이 1차원 ndarray임.

In [27]:
# 원본 파일 다시 로딩 
titanic_df = pd.read_csv('titanic_train.csv')
# index 객체 추출 
indexes = titanic_df.index 
print(indexes,'\n')
# index 객체를 실제 값 array로 변환 
print(indexes.values)

RangeIndex(start=0, stop=891, step=1)

[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [28]:
# ndarray와 유사하게 단일 값 반환 및 슬라이싱도 가능함. 
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes.values[:5])
print(indexes[6])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
[0 1 2 3 4]
6

In [29]:
# 한번 만들어진 index 객체는 함부로 변경할 수 없음. 에러가 뜬다.
# indexes[0] = 5

In [30]:
# index는 식별용이지, 연산 수행하지 않음. 
series_fair = titanic_df['Fare']
print('Fair Series max 값:', series_fair.max())
print('Fair Series sum 값:', series_fair.sum())
print('sum() Fair Series:', sum(series_fair))
print('Fair Series + 3:\n', (series_fair + 3).head(3))

Fair Series max 값: 512.3292
Fair Series sum 값: 28693.9493
sum() Fair Series: 28693.949299999967
Fair Series + 3:
 0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

- **df.reset_index()**: 새롭게 인덱스를 연속 숫자형으로 할당하며, 기존 인덱스는 'index'라는 새로운 칼럼 명으로 추가함. 
- 인덱스가 연속된 int 숫자형 데이터가 아닐 경우에 다시 이를 연속 int 숫자형 데이터로 만들 때 주로 사용함. 
- Series에 reset_index()를 적용하면 Series가 아닌 DataFrame이 반환됨.

In [31]:
# 맨 왼쪽이 새로운 index, index 칼럼이 연속 숫자형(기존 인덱스였음)
titanic_reset_df = titanic_df.reset_index(inplace=False)
titanic_reset_df.head(3)

   index  PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0      0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500   NaN        S
1      1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2      2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250   NaN        S

In [32]:
print('### before reset_index ###')
value_counts = titanic_df['Pclass'].value_counts()
print(value_counts)
print('value_counts 객체 변수 타입:', type(value_counts))
new_value_counts = value_counts.reset_index(inplace=False)
print('### After reset_index ###')
print(new_value_counts)               
print('new_value_counts 객체 변수 타입:', type(new_value_counts))

### before reset_index ###
3    491
1    216
2    184
Name: Pclass, dtype: int64
value_counts 객체 변수 타입: <class 'pandas.core.series.Series'>
### After reset_index ###
   index  Pclass
0      3     491
1      1     216
2      2     184
new_value_counts 객체 변수 타입: <class 'pandas.core.frame.DataFrame'>

#### 데이터 셀렉션 및 필터링 

##### DataFrame의 [ ] 연산자 

- DataFrame 바로 뒤에 있는 '[ ]' 안에 들어갈 수 있는 것은 칼럼 명 문자 또는 인덱스로 변환 가능한 표현식 
- DataFrame 바로 뒤의 [ ] 연산자는 넘파이나 Series의 [ ]와 다름.
- DataFrame 바로 뒤의 [ ] 내 입력 값은 칼럼명을 지정해 칼럼 지정 연산에 사용하거나 불린 인덱스 용도로만 사용해야 함. 
- DataFrame[0:2]와 같은 슬라이싱 연산으로 데이터를 추출하는 방법은 사용하지 않는게 좋음.

In [33]:
# 단일 칼럼 데이터 추출 
print(titanic_df['Pclass'].head(3))
# 여러 칼럼 데이터 추출 
print(titanic_df[['Survived','Pclass']].head(3))

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Survived  Pclass
0         0       3
1         1       1
2         1       3

In [34]:
# 판다스의 인덱스 형태로 변환 가능한 표현식 
titanic_df[0:2]

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0  A/5 21171   7.2500   NaN        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0   PC 17599  71.2833   C85        C

In [35]:
# 불린 인덱싱 표현도 가능! 매우 자주 사용. 
titanic_df[titanic_df['Pclass'] == 3].head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket   Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171  7.250   NaN        S
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...  7.925   NaN        S
4            5         0       3  Allen, Mr. ...    male  35.0      0      0          373450  8.050   NaN        S

##### DataFrame ix[ ] 연산자 

- ix[ ] 는 곧 없어질 예정이므로, **loc[]**이나 **iloc[]**을 사용할 것을 더 권장함.
- 넘파이 ndarray [ ] 연산자와 동일하게 단일 지정, 슬라이싱, 불린 인덱싱, 팬시 인덱싱 모두 가능

In [36]:
data = {'Name' : ['Chulmin', 'Eunkyung','Jinwoong','Soobeom'],
       'Year' : [2011, 2016, 2015, 2015],
       'Gender' : ['Male', 'Female', 'Male', 'Male']
       }
data_df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
data_df

           Name  Year  Gender
one     Chulmin  2011    Male
two    Eunkyung  2016  Female
three  Jinwoong  2015    Male
four    Soobeom  2015    Male

In [37]:
# 첫번째 로우, 첫번째 칼럼 위치에 있는 단일 값 반환
data_df.ix[0,0]

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:961: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  return getattr(section, self.name)[new_key]

'Chulmin'

In [38]:
# one 인덱스의 첫번째 값
data_df.ix['one', 0]

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated

'Chulmin'

In [39]:
data_df.ix[0:2, [0,1]]

/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/Users/harampark/opt/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

         Name  Year
one   Chulmin  2011
two  Eunkyung  2016

### 2020-03-11-Wed

진도: 04. 데이터 핸들링 - 판다스 ~ (64쪽~)

##### 명칭 기반 인덱싱과 위치 기반 인덱싱의 구분 

- 명칭 기반 인덱싱: 칼럼의 명칭을 기반으로 위치를 지정하는 방식 ex. loc[ ]
- 위치 기반 인덱싱: 0을 출발점으로 하는 가로축, 세로축 좌표 기반의 행과 열 위치 기반으로 데이터를 지정하는 방식 ex. iloc[ ]

##### DataFrame iloc[ ] 연산자 
- 행과 열 값으로 integer나 interger형의 슬라이싱, 팬시 리스트 값을 입력해줘야 함. 
- 불린 인덱싱은 제공하지 않음.

In [40]:
data_df.iloc[0,0]

'Chulmin'

In [41]:
data_df.iloc[1:3, 0]

two      Eunkyung
three    Jinwoong
Name: Name, dtype: object

##### DataFrame loc [ ] 연산자 
- 행 위치에는 DataFrame index 값을, 열 위치에는 칼럼 명 입력
- loc[ ]의 슬라이싱 기호를 적용하면 **종료 값**까지 포함하는 것!

In [42]:
data_df.loc['one', 'Name']

'Chulmin'

##### 불린 인덱싱 
- ix, iloc, loc와 같이 명확히 인덱싱을 지정하는 방식보다는 불린 인덱싱에 의존해 데이터를 가져오는 경우가 더 많음

In [43]:
# 승객 중 나이가 60세 이상인 데이터 추출 
titanic_df = pd.read_csv('titanic_train.csv')
titanic_boolean = titanic_df[titanic_df['Age'] > 60]
print(type(titanic_boolean))  # DataFrame으로 출력됨
titanic_boolean

<class 'pandas.core.frame.DataFrame'>

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch       Ticket      Fare        Cabin Embarked
33            34         0       2  Wheadon, Mr...    male  66.0      0      0   C.A. 24579   10.5000          NaN        S
54            55         0       1  Ostby, Mr. ...    male  65.0      0      1       113509   61.9792          B30        C
96            97         0       1  Goldschmidt...    male  71.0      0      0     PC 17754   34.6542           A5        C
116          117         0       3  Connors, Mr...    male  70.5      0      0       370369    7.7500          NaN        Q
170          171         0       1  Van der hoe...    male  61.0      0      0       111240   33.5000          B19        S
252          253         0       1  Stead, Mr. ...    male  62.0      0      0       113514   26.5500          C87        S
275          276         1       1  Andrews, Mi...  female  63.0      1      0        13502   77.9583           D7        S
280          281         0       3  Duane, Mr. ...    male  65.0      0      0       336439    7.7500          NaN        Q
326          327         0       3  Nysveen, Mr...    male  61.0      0      0       345364    6.2375          NaN        S
438          439         0       1  Fortune, Mr...    male  64.0      1      4        19950  263.0000  C23 C25 C27        S
456          457         0       1  Millet, Mr....    male  65.0      0      0        13509   26.5500          E38        S
483          484         1       3  Turkula, Mr...  female  63.0      0      0         4134    9.5875          NaN        S
493          494         0       1  Artagaveyti...    male  71.0      0      0     PC 17609   49.5042          NaN        C
545          546         0       1  Nicholson, ...    male  64.0      0      0          693   26.0000          NaN        S
555          556         0       1  Wright, Mr....    male  62.0      0      0       113807   26.5500          NaN        S
570          571         1       2  Harris, Mr....    male  62.0      0      0  S.W./PP 752   10.5000          NaN        S
625          626         0       1  Sutton, Mr....    male  61.0      0      0        36963   32.3208          D50        S
630          631         1       1  Barkworth, ...    male  80.0      0      0        27042   30.0000          A23        S
672          673         0       2  Mitchell, M...    male  70.0      0      0   C.A. 24580   10.5000          NaN        S
745          746         0       1  Crosby, Cap...    male  70.0      1      1    WE/P 5735   71.0000          B22        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0       113572   80.0000          B28      NaN
851          852         0       3  Svensson, M...    male  74.0      0      0       347060    7.7750          NaN        S

In [44]:
# 불린 인덱싱 결과값이 데이터프레임이므로 다시 [ ]를 해줄 수 있음
titanic_df[titanic_df['Age'] > 60][['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

In [45]:
titanic_df.loc[titanic_df['Age'] > 60, ['Name', 'Age']].head(3)

              Name   Age
33  Wheadon, Mr...  66.0
54  Ostby, Mr. ...  65.0
96  Goldschmidt...  71.0

- and 조건일 때는 &
- or 조건일 때는 |
- Not 조건일 때는 ~

In [46]:
# 나이가 60세 이상이고, 선실 등급이 1등급이며, 성별이 여성인 승객을 추출하기 
titanic_df[(titanic_df['Age'] > 60) & (titanic_df['Pclass'] == 1) & (titanic_df['Sex'] == 'female')]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

In [47]:
# 개별 조건을 변수에 할당해서 변수를 결합해 불린 인덱싱을 사용할 수도 있음. 
cond1 = titanic_df['Age'] > 60
cond2 = titanic_df['Pclass'] == 1
cond3 = titanic_df['Sex'] == 'female'
titanic_df[ cond1 & cond2 & cond3 ]

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch  Ticket     Fare Cabin Embarked
275          276         1       1  Andrews, Mi...  female  63.0      1      0   13502  77.9583    D7        S
829          830         1       1  Stone, Mrs....  female  62.0      0      0  113572  80.0000   B28      NaN

### 2020-03-12-Thu

진도: 04. 데이터 핸들링 - 판다스 ~ 끝! (74쪽~86쪽)

#### 정렬, Aggregation 함수, GroupBy 적용 

##### DataFrame, Serie의 정렬 - sort_values()

- **sort_values()**: DataFrame과 Serie를 정렬할 때 사용
- 주요 파라미터는 **by, ascending, inplace**!

In [48]:
# 이름 오름차순 정렬
titanic_sorted = titanic_df.sort_values(by=['Name'])
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch     Ticket   Fare Cabin Embarked
845          846         0       3  Abbing, Mr....    male  42.0      0      0  C.A. 5547   7.55   NaN        S
746          747         0       3  Abbott, Mr....    male  16.0      1      1  C.A. 2673  20.25   NaN        S
279          280         1       3  Abbott, Mrs...  female  35.0      1      1  C.A. 2673  20.25   NaN        S

In [51]:
# Pclass와 Name을 내림차순으로 정렬! 
titanic_sorted = titanic_df.sort_values(by=['Pclass','Name'], ascending=False)
titanic_sorted.head(3)

     PassengerId  Survived  Pclass            Name   Sex   Age  SibSp  Parch    Ticket  Fare Cabin Embarked
868          869         0       3  van Melkebe...  male   NaN      0      0    345777   9.5   NaN        S
153          154         0       3  van Billiar...  male  40.5      0      2  A/5. 851  14.5   NaN        S
282          283         0       3  de Pelsmaek...  male  16.0      0      0    345778   9.5   NaN        S

##### Aggregation 함수 적용 

- aggregation 함수: min(), max(), sum(), count() 등

In [52]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [53]:
# 특정 칼럼에만 aggregation 함수 적용하기 
titanic_df[['Age', 'Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

#### groupby() 적용 

- 분석 작업에 많이 활용함. 
- groupby() 사용 시 입력 파라미터 by에 칼럼을 입력하면 대상 칼럼으로 groupby됨.

In [54]:
titanic_groupby = titanic_df.groupby(by='Pclass')
print(type(titanic_groupby))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

In [55]:
titanic_groupby = titanic_df.groupby('Pclass').count()
titanic_groupby

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  Cabin  Embarked
Pclass
1               216       216   216  216  186    216    216     216   216    176       214
2               184       184   184  184  173    184    184     184   184     16       184
3               491       491   491  491  355    491    491     491   491     12       491

In [58]:
# groupby의 type이 DataFrameGroupBy이기 때문에 이렇게 [ ]가 가능한 것
titanic_groupby = titanic_df.groupby('Pclass')[['PassengerId', 'Survived']].count()
titanic_groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [61]:
titanic_df.groupby('Pclass')['Age'].agg([max, min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

In [62]:
agg_format = {'Age':'max', 'SibSp':'sum','Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

#### 결손 데이터 처리하기 

- 결손 데이터는 판다스에서 NULL인 경우고, numpy의 NaN으로 표시함. 
- 기본적으로 머신러닝 알고리즘은 이 NaN 값을 처리하지 않으므로 이 값을 다른 값으로 대체해야 함. 
- NaN 값은 평균, 총합 등의 함수 연산 시 제외됨.

##### isna()로 결손 데이터 여부 확인
- **isna()**: NaN 여부를 확인하는 API

In [63]:
titanic_df.isna().head(3)

   PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket   Fare  Cabin  Embarked
0        False     False   False  False  False  False  False  False   False  False   True     False
1        False     False   False  False  False  False  False  False   False  False  False     False
2        False     False   False  False  False  False  False  False   False  False   True     False

In [64]:
# 결손 데이터 개수 구하기 
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

##### fillna()로 결손 데이터 대체하기 
- **fillna()**: NaN 값을 다른 값으로 대체하는 API

In [65]:
# Cabin 칼럼의 NaN 값을 'C000'으로 대체 
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df.head(3)

   PassengerId  Survived  Pclass            Name     Sex   Age  SibSp  Parch          Ticket     Fare Cabin Embarked
0            1         0       3  Braund, Mr....    male  22.0      1      0       A/5 21171   7.2500  C000        S
1            2         1       1  Cumings, Mr...  female  38.0      1      0        PC 17599  71.2833   C85        C
2            3         1       3  Heikkinen, ...  female  26.0      0      0  STON/O2. 31...   7.9250  C000        S

In [70]:
# Age 칼럼의 NaN 값 = 평균 나이, Embarked 칼럼의 NaN 값 = S로 대체하기 
titanic_df['Age'] = titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked'] = titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()   # 결손 데이터가 하나도 없는 것으로 뜸!

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

#### apply lambda 식으로 데이터 가공 

- apply 함수에 lambda 식을 결합해 DataFrame이나 Series의 레코드별로 데이터를 가공하는 기능을 제공함. 
- 복잡한 데이터 가공이 필요할 경우 어쩔 수 없이 apply lambda를 이용한 것!
- lambda 식은 파이썬에서 함수형 프로그래밍을 지원하기위해서 만든 것

In [71]:
# 입력값의 제곱 값을 구해서 반환하는 get_square(a) 함수가 있다고 하자. 
def get_square(a):
    return a**2

print('3의 제곱은:', get_square(3))

3의 제곱은: 9

In [72]:
# lambda는 이러한 함수의 선언과 함수 내의 처리를 한 줄의 식으로 쉽게 변환하는 식
lambda_square = lambda x : x ** 2
print('3의 제곱은:', lambda_square(3))

3의 제곱은: 9

- lambda x : x ** 2
- lambda **입력인자** : **입력 인자를 기반으로 한 계산식, 호출 시 계산 결과가 반환됨**
- 여러 개의 값을 입력인자로 사용할 경우 보통 map()를 결합

In [73]:
a=[1,2,3]
squares = map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [74]:
# 이름 철자 개수 세기
titanic_df['Name_len'] = titanic_df['Name'].apply(lambda x : len(x))
titanic_df[['Name', 'Name_len']].head()

             Name  Name_len
0  Braund, Mr....        23
1  Cumings, Mr...        51
2  Heikkinen, ...        22
3  Futrelle, M...        44
4  Allen, Mr. ...        24

In [75]:
# 나이가 15세 미만이면 'child', 그렇지 않으면 'Adult'
titanic_df['Child_Adult'] = titanic_df['Age'].apply(lambda x : 'Child' if x <= 15 else 'Adult')
titanic_df[['Age', 'Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [76]:
# 나이가 15세 이하면 Child, 15~60세 사이는 Adult, 61세 이상은 Elderly
titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : 'Child' if x<=15 
                                                else ('Adult' if x <= 60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [77]:
# 나이에 따라 세분화된 분류를 수행하는 함수 생성 
def get_category(age):
    cat = ''
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat 

titanic_df['Age_cat'] = titanic_df['Age'].apply(lambda x : get_category(x))
titanic_df[['Age', 'Age_cat']].head()

    Age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult